#ifndef CTIMESTAMP_H
#define CTIMESTAMP_H

#ifdef __cplusplus
extern "C" {
#endif

///////////////////////////////////////////////////////////////////
//函数名称： GetTimeStamp
//功能描述： 获取相对时间戳，此时间戳相对1970.1.1 0:0:0.0的时间差。不支持超过纳秒级的精度
//参数说明： type--0:秒；1:毫秒;2:微秒;3:纳秒
//返回值：   时间戳
//作者：wangfei
//时间：2023/11/28
///////////////////////////////////////////////////////////////////
double GetTimeStamp(int type = 2);

///////////////////////////////////////////////////////////////////
//函数名称： TimeStampToStr
//功能描述： 相对时间戳转换为字符串格式，字符串格式为:2023-02-23 03:02:01.008
//参数说明： outbuf--输出字符串
//          ts--时间戳相对1970-1-1 0:0:0.0的时间差
//          type--0:秒；1:毫秒;2:微秒;3:纳秒
//返回值：   无
//作者：wangfei
//时间：2023/11/28
///////////////////////////////////////////////////////////////////
void TimeStampToStr(char* outbuf, double ts, int type = 2);

///////////////////////////////////////////////////////////////////
//函数名称： TimeStampToStr
//功能描述： 字符串格式转换为相对时间戳，输入字符串格式为:2023-02-23 03:02:01.008
//参数说明： buf--输入字符串格式为:2023-02-23 03:02:01.008
//          type--0:秒；1:毫秒;2:微秒;3:纳秒
//返回值：   时间戳相对1970-1-1 0:0:0.0的时间差
//作者：wangfei
//时间：2024/05/23
///////////////////////////////////////////////////////////////////
double StrToTimeStamp(char* buf, int type = 2);


void GetCurrentTimeStampStr(char* outbuf, int type);

bool IsValidTimeStamp(double ts, int type);

#ifdef __cplusplus
}
#endif

#endif // CTIMESTAMP_H
